In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('Social_Network_Ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [4]:
df.isna().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [5]:
df_onehot = pd.get_dummies(df['Gender'])

In [6]:
df_onehot

     Female  Male
0         0     1
1         0     1
2         1     0
3         1     0
4         0     1
..      ...   ...
395       1     0
396       0     1
397       1     0
398       0     1
399       1     0

[400 rows x 2 columns]

In [7]:
df=df.drop('Gender',axis=1)

In [8]:
df = df.join(df_onehot)

In [9]:
df

      User ID  Age  EstimatedSalary  Purchased  Female  Male
0    15624510   19            19000          0       0     1
1    15810944   35            20000          0       0     1
2    15668575   26            43000          0       1     0
3    15603246   27            57000          0       1     0
4    15804002   19            76000          0       0     1
..        ...  ...              ...        ...     ...   ...
395  15691863   46            41000          1       1     0
396  15706071   51            23000          1       0     1
397  15654296   50            20000          1       1     0
398  15755018   36            33000          0       0     1
399  15594041   49            36000          1       1     0

[400 rows x 6 columns]

In [10]:
x = df.drop(['User ID','Purchased'],axis=1)

In [12]:
x.head()

   Age  EstimatedSalary  Female  Male
0   19            19000       0     1
1   35            20000       0     1
2   26            43000       1     0
3   27            57000       1     0
4   19            76000       0     1

In [13]:
y = df['Purchased']

In [16]:
from sklearn.preprocessing import MinMaxScaler
sc = MinMaxScaler()
x['EstimatedSalary']=sc.fit_transform(x[['EstimatedSalary']])

In [17]:
x.head()

   Age  EstimatedSalary  Female  Male
0   19         0.029630       0     1
1   35         0.037037       0     1
2   26         0.207407       1     0
3   27         0.311111       1     0
4   19         0.451852       0     1

In [18]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,random_state=4,test_size=0.25)

In [20]:
x_train.shape

(300, 4)

In [22]:
x_test.shape

(100, 4)

In [23]:
y_train.shape

(300,)

In [24]:
y_test.shape

(100,)

In [25]:
from sklearn.linear_model import LogisticRegression
lr=LogisticRegression()
lr.fit(x_train,y_train)
y_pred=lr.predict(x_test)

In [26]:
from sklearn.metrics import accuracy_score
acc=accuracy_score(y_test,y_pred)
acc

0.86

In [41]:
from sklearn.neighbors import KNeighborsClassifier as KNN
kn= KNN(n_neighbors= 9)
kn.fit(x_train,y_train)
y_pred=kn.predict(x_test)

In [42]:
acc=accuracy_score(y_test,y_pred)
acc

0.88

In [43]:
from sklearn.svm import SVC
svm=SVC()
svm.fit(x_train,y_train)
y_pred=svm.predict(x_test)

In [44]:
acc=accuracy_score(y_test,y_pred)
acc

0.87